<?php


//$config['site_title'] = "NHK Cheker";
$config['site_title'] = "NHKリマインド";
$config['nhk_credit'] = "「情報提供:ＮＨＫ」";

$config['ical_unique_id'] = 'nhk-remind_kazuki.m';
$config['ical_name'] = 'NHK番組リマインド';


//$config['webmasterkey'] = 'afOKYncT0Bi4ipc6FjrnATlOjVNUaaR0LjCZ5i-AvtI';
$config['webmasterkey'] = '';

//$config['ga_tracking_id'] = 'UA-59633213-1';
$config['ga_tracking_id'] = '';

$config['service_list'] = array(
      'g1' => 'ＮＨＫ総合１',
      'g2' => 'ＮＨＫ総合２',
      'e1' => 'ＮＨＫＥテレ１',
      'e2' => 'ＮＨＫＥテレ２',
      'e3' => 'ＮＨＫＥテレ３',
      'e4' => 'ＮＨＫワンセグ２',
      's1' => 'ＮＨＫＢＳ１',
      's2' => 'ＮＨＫＢＳ１(１０２ｃｈ)',
      's3' => 'ＮＨＫＢＳプレミアム',
      's4' => 'ＮＨＫＢＳプレミアム(１０４ｃｈ)',
    );


$config['genre_primary_list'] = array(
      '00' => 'ニュース／報道',
      '01' => 'スポーツ',
      '02' => '情報／ワイドショー',
      '03' => 'ドラマ',
      '04' => '音楽',
      '05' => 'バラエティ',
      '06' => '映画',
      '07' => 'アニメ／特撮',
      '08' => 'ドキュメンタリー／教養',
      '09' => '劇場／公演',
      '10' => '趣味／教育',
      '11' => '福祉',
      '15' => 'その他',
    );

$config['time_list'] = array(
      '05:00' => '05:00',
      '07:00' => '07:00',
      '09:00' => '09:00',
      '11:00' => '11:00',
      '13:00' => '13:00',
      '15:00' => '15:00',
      '17:00' => '17:00',
      '19:00' => '19:00',
      '21:00' => '21:00',
      '23:00' => '23:00',
      '25:00' => '25:00',
      '27:00' => '27:00',
    );
